app/views/share/_header_menu.html.erb

    <div class="link_wrap">
      <a href="<%= main_statistic_path(:user_id => current_user.id, :field_id => Field.find(current_user.golf_club.id)) %>"><img src="/images/results_icon.png" alt="" /><p>Statistics</p></a>
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`id` = 1 LIMIT 1