app/views/share/_header_menu.html.erb

      <% unless current_user.golf_club == nil %>
        <% if current_user.sticks.count > 0 && Statistic.where(:user_id == current_user.id).count > 0  && current_user.golf_club != nil%>
          <% @field_id = Field.where(:golf_club_id => current_user.golf_club.id).first %>
---
SELECT COUNT(*) FROM `sticks` INNER JOIN `users_sticks` ON `sticks`.id = `users_sticks`.stick_id WHERE ((`users_sticks`.user_id = 1))
SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
SELECT `fields`.* FROM `fields` WHERE `fields`.`golf_club_id` = 1 LIMIT 1