app/views/admin/golf_clubs/edit.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    <div class="column">
      <% @user = User.find(@golf_club.user_id) %>