app/views/admin/golf_clubs/index.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    <div class="row">
      <% @user = User.find(club.user_id) %>