app/views/game_statistics/_view_by_sticks.html.erb


<% UsersStick.where(:user_id => current_user.id).each do |c_user_stick|%>
  <% @stats = GameStatisticsBySticks.find(:first, :conditions => {:game_id => @game.id, :users_stick_id => c_user_stick.id})%>
---
SELECT `users_sticks`.* FROM `users_sticks` WHERE `users_sticks`.`user_id` = 1
SELECT `game_statistics_by_sticks`.* FROM `game_statistics_by_sticks` WHERE `game_statistics_by_sticks`.`game_id` = 1 AND `game_statistics_by_sticks`.`users_stick_id` = 1 LIMIT 1
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 1 LIMIT 1