app/views/game_statistics/_view_by_holes.html.erb

SELECT `game_statistics_by_holes`.* FROM `game_statistics_by_holes` WHERE `game_statistics_by_holes`.`game_id` = 1 AND `game_statistics_by_holes`.`hole_number` = 1 LIMIT 1
---
      <% @holes_filtered.each do |hole|%>
      <% @statistics = GameStatisticsByHoles.find(:first, :conditions => {:game_id => @game.id, :hole_number => hole.hole_number})%>