app/controllers/admin/countries_controller.rb

 def create
       @country = Country.new(params[:country])
      @country.save
---
INSERT INTO `countries` (`updated_at`, `name`, `created_at`) VALUES ('2011-07-08 07:12:24', 'Latvia', '2011-07-08 07:12:24')