app/controllers/admin/golf_clubs_controller.rb

  def edit
    @golf_club = GolfClub.find(params[:id])
---
SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1

  def update
    @golf_club = GolfClub.find(params[:id])
    @golf_club.update_attributes(:accepted => params[:status])
    @user = User.find(@golf_club.user_id)

    @user.update_attributes(:admin => 1, :golf_club_id => @golf_club.id) if params[:status] == "yes"
---
SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
UPDATE `golf_clubs` SET `updated_at` = '2011-07-08 07:26:43', `accepted` = 'yes' WHERE `golf_clubs`.`id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `last_request_at` = '2011-07-08 07:26:43', `updated_at` = '2011-07-08 07:26:43' WHERE `users`.`id` = 4