app/controllers/admin/hints_controller.rb

  def index
    @all_admins = User.where(:admin => true)
    @all_hints = Hint.all
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = 1
SELECT `hints`.* FROM `hints`