app/controllers/admin/sticks_controller.rb

  def edit
    @stick = Stick.find(params[:id])
---
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 2 LIMIT 1

  def update
    @stick = Stick.find(params[:id])
    if @stick.update_attributes(params[:stick])
---
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 2 LIMIT 1
UPDATE `sticks` SET `updated_at` = '2011-07-08 07:56:08', `degrees` = 2, `shaft_strength` = '2', `shaft` = '2' WHERE `sticks`.`id` = 1