app/controllers/admin/users_controller.rb

  def index

    @users = User.where(:is_super_admin => false)
---
SELECT `users`.* FROM `users` WHERE `users`.`is_super_admin` = 0