app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def index

    @users = User.find(:all)