app/views/games/_form_plan.html.erb

SELECT `fields`.* FROM `fields`
---
          <div class="input">
            <%= f.collection_select( :field_id,  Field.all, :id, :name, {:prompt => "Izvēlies.."}, {:class => "dropdown3 game_input_select"} ) %>