app/views/games/_form_res.html.erb

          <div class="input">
            <%= f.collection_select( :field_id,  Field.all, :id, :name, {:prompt => "Izvēlies.."}, {:class => "dropdown3 game_input_select"} ) %>
---
SELECT `fields`.* FROM `fields`