app/views/games/_hit_form_results.html.erb

SELECT `hits`.* FROM `hits` WHERE (`hits`.game_id = 1)
SELECT `sticks`.* FROM `sticks` INNER JOIN `users_sticks` ON `sticks`.id = `users_sticks`.stick_id WHERE ((`users_sticks`.user_id = 1))
---
<script>
$(document).ready(function(){
	$('#header_menu_div').html('<%= render :partial => 'share/header_menu', :locals => {:header_menu_active_class => "game_results"} %>');
}
</script>
      <% game1 = game.game_type%>
      <div class="right_coll">
        <%=form_for( game, :url => ('/hit_update/' + game.id.to_s + '/'), :html => {:id => "hit_form"}, :remote => true) do |game|%>
        <input type="hidden" name="next_hit" id="nexthit" value=0>
        <input type="hidden" name="form_id" id="formid" value="results">
        <input type="hidden" name="active_hit" id="act_hit" value=1>
        <input type="hidden" name="next_hole" id="nexthole" value=<%=active_hole%>>
        <div class="headings">
          <p>Club</p>
          <div class="heading1"><p>Hit distance(m)</p></div>
          <div class="heading2"><p>Land place</p></div>
        </div>
        <div class="clear"></div>
        <div class="dropdowns_wrap">
          <% hits.each do |hit|%>
          <% if hit.stick_id == 1 %>
          <% hit_style = "putt_style" %>