app/views/games/_hit_form_plan.html.erb

SELECT `hits`.* FROM `hits` WHERE (`hits`.game_id = 1)
---
<script>
$(document).ready(function(){
	$('#header_menu_div').html('<%= render :partial => 'share/header_menu', :locals => {:header_menu_active_class => "game_plan"} %>');
}
</script>

<div class="right_coll" style="min-width:656px">
<%game1 = game.game_type%>
<%=form_for( game, :url => ('/hit_update/' + game.id.to_s + '/'), :html => {:id => "hit_form"}, :remote => true) do |g|%>

<input type="hidden" name="next_hit" id="nexthit" value=0>
<input type="hidden" name="form_id" id="formid" value="plan">
<input type="hidden" name="active_hit" id="act_hit" value=<%=active_hit%>>
<input type="hidden" name="next_hole" id="nexthole" value=<%=active_hole%>>
<div class="headings">
          <p>Club</p>
          <div class="heading1"><p>Hit distance(m)</p></div>
          <div class="heading2"><p>Land place</p></div>
        </div>
        <div class="clear"></div>
<div class="dropdowns_wrap">
<% hit.each do |hits| %>