app/views/games/_index_partial.html.erb

<script>
$(document).ready(function(){
	$('#header_menu_div').html('<%= render :partial => 'share/header_menu', :locals => {:header_menu_active_class => "my_games"} %>');
}
</script>


<% @games.each do |game| %>

    <div class="single_game_wrap" id="game_<%= game.id%>">
      <div class="date_wrap">
        <p><%=l game.date, :format => :game %></p>
      </div>
      <div class="field_name_wrap">
        <% field = Field.find(:first, :conditions => {:id => game.field_id})%>
        <p><%=field.name%></p>
      </div>
      <div class="links">
        <a href="<%='/game_plan/' + game.id.to_s + '/1/1/new'%>" class="<%= fetch_color_for_plan_button(game.id)%>">Game plan</a>
       <!-- <% hit_real = Hit.find(:first, :conditions => {:game_id => game.id, :real_hit => 'r'})%>
        <% if hit_real %>
        <a href="<%='/game_results/' + game.id.to_s + '/1/results/new/0'%>" class="green_button">Results</a>
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`id` = 1 LIMIT 1
SELECT `hits`.* FROM `hits` WHERE `hits`.`game_id` = 1 AND `hits`.`real_hit` = 'p' LIMIT 1