app/views/games/index.html.erb

SELECT COUNT(*) FROM `games` WHERE `games`.`user_id` = 1
---

  <% @my_games_for_count = Game.where(:user_id => current_user.id) %>