app/views/user/_form.html.erb

SELECT `countries`.* FROM `countries`
---
        <div class="text">
          <p><%= f.label t "form.country" %></p>

SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`accepted` = 'yes'
---
            <div class="input" id = "golf_club_checkbox">
              <% @golf_club = GolfClub.where(:accepted => "yes") %>