app/views/user/_stick_form.html.erb

      <div class="element"><%= f.label :stick_type %></div>
      <div class="element"><%= h.collection_select :stick_id, Stick.all, :id, :stick_type, {:prompt => "Select Stick"},{:class => "dropdown4", :onchange => "fill_sticks_form(this)"} %></div>
---
SELECT `sticks`.* FROM `sticks`