app/views/golf_club/new.html.erb

SELECT `countries`.* FROM `countries`
---
        <div class="text">
          <p><%= f.label t "form.country" %></p>