app/controllers/fields_controller.rb

  def edit
    @field = Field.find(params[:id])

    @hole_attributes_name = "holes_attributes[]"
    @new_hole_attributes_name = (@field.holes.count > 0) ? "new_holes_attributes[]" : @hole_attributes_name
    @hit_place_attributes_name = "hit_places_attributes[]"
    @new_hit_place_attributes_name = (@field.hit_places.count > 0) ?  "new_hit_places_attributes[]" : @hit_place_attributes_name
    @green_fee_attributes_name = "green_fees_attributes[]"
    @new_green_fee_attributes_name = (@field.green_fees.count > 0) ?  "new_green_fees_attributes[]" : @green_fee_attributes_name
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `holes` WHERE (`holes`.field_id = 1)
SELECT `holes`.* FROM `holes` WHERE (`holes`.field_id = 1)
SELECT COUNT(*) FROM `hit_places` WHERE (`hit_places`.field_id = 1)
SELECT COUNT(*) FROM `green_fees` WHERE (`green_fees`.field_id = 1)
SELECT `green_fees`.* FROM `green_fees` WHERE (`green_fees`.field_id = 1)

  def create
    @golf_club = current_user.golf_club
    @field = @golf_club.fields.new(params[:field])

    respond_to do |format|
      if @field.save
---
INSERT INTO `fields` (`normal_distance`, `golf_club_id`, `long_distance`, `short_distance`, `very_short_distance`, `updated_at`, `created_at`, `name`) VALUES (4, 1, 3, 4, 3, '2011-07-25 09:01:12', '2011-07-25 09:01:12', 'Laukums 1')

  def update
    @field = Field.find(params[:id])
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`id` = 1 LIMIT 1