app/controllers/games_controller.rb

 def index
 	@games = Game.find(
            :all,
            :conditions => {:user_id => current_user.id},
            :order =>  'created_at desc',
            :limit => 5
            )
---
SELECT `games`.* FROM `games` WHERE `games`.`user_id` = 1 ORDER BY created_at desc LIMIT 5

	def get_stats
		@game_holes
	  @field = Field.find(:first, :conditions => {:id => @game.field_id})
---
SELECT `fields`.* FROM `fields` WHERE `fields`.`id` = 1 LIMIT 1

	def create
  	@game = Game.new(params[:game])
    @game.save
---
INSERT INTO `games` (`game_format`, `date`, `field_id`, `form`, `weather`, `next_hole`, `hit_direction`, `start_place_colors`, `updated_at`, `user_id`, `active_hit`, `green_quality`, `created_at`, `comment`, `temperature`, `game_type`, `field_quality`) VALUES ('tn', '2011-07-06 00:00:00', 1, NULL, NULL, NULL, NULL, 3, '2011-07-25 09:08:11', 2, NULL, NULL, '2011-07-25 09:08:11', NULL, NULL, 1, NULL)

	def plan
  	game_holes
    @active_hit = params[:active_hit].to_i
    if @active_hit == 0
    	@active_hit = 1
    end
    @active_hole = params[:active_hole].to_i
    if @active_hole < @start_hole
    	@active_hole = @start_hole
    end
    conditions = { :game_id => @game.id,
               :hole_number => @active_hole,
               :hit_number => 1,
               :real_hit => 'p',
               :user_id => current_user.id}
 	 	@hit = Hit.where(:game_id => @game.id,:hole_number => @active_hole, :real_hit => 'p', :user_id => current_user.id)
		unless @hit.any?
			@hit = []
			@hit = @hit << Hit.create(conditions)
---
SELECT `hits`.* FROM `hits` WHERE `hits`.`real_hit` = 'p' AND `hits`.`game_id` = 4 AND `hits`.`hole_number` = 1 AND `hits`.`user_id` = 2
SELECT COUNT(*) FROM `hits` WHERE `hits`.`game_id` = 1 AND `hits`.`hole_number` = 1 AND `hits`.`user_id` = 1 AND `hits`.`real_hit` = 'p'
INSERT INTO `hits` (`land_place`, `direction`, `comment`, `misdirection`, `difficulty`, `stance`, `hole_comment`, `wind`, `luck_factor`, `distance_to_hole`, `mistake`, `hole_number`, `pair_id`, `hit_was`, `following_action`, `slipums`, `updated_at`, `strength`, `stick_id`, `hit_number`, `kritums`, `hole_id`, `user_id`, `place_from`, `hit_distance`, `created_at`, `game_id`, `trajectory`, `motion_was`, `real_hit`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, '2011-07-08 08:49:28', NULL, NULL, 1, NULL, NULL, 1, NULL, NULL, '2011-07-08 08:49:28', 1, NULL, NULL, 'p')

  def results
  	@form_id = 'results'
    game_holes
    @active_hit = params[:active_hit].to_i
    @active_hole = params[:active_hole].to_i
    @hitcount = params[:hits].to_i
    if @active_hit == 0
    	@active_hit = 1
    end
    @puts = params[:puts].to_i
    if @hitcount == nil || @hitcount == 0
    	@hitcount = 5
      @puts = 2
    end

    @form_id = 'results'
    if @active_hole < @start_hole
    	@active_hole = @start_hole
    end
    if @hitcount != 0
       @hits = Hit.where(:game_id => @game.id,:hole_number => @active_hole,:real_hit => 'r')
---
SELECT `hits`.* FROM `hits` WHERE `hits`.`real_hit` = 'r' AND `hits`.`game_id` = 3 AND `hits`.`hole_number` = 1

                              :hole_number => @active_hole,
                              :hit_number => i,
                              :real_hit => 'r'}
         @hit = Hit.find(:first, :conditions => conditions) || Hit.create(conditions)
---
INSERT INTO `hits` (`real_hit`, `stance`, `comment`, `luck_factor`, `hit_was`, `hit_distance`, `difficulty`, `pair_id`, `following_action`, `stick_id`, `strength`, `distance_to_hole`, `user_id`, `hit_number`, `misdirection`, `direction`, `created_at`, `motion_was`, `land_place`, `game_id`, `hole_id`, `hole_number`, `wind`, `mistake`, `trajectory`, `place_from`, `slipums`, `hole_comment`, `updated_at`, `kritums`) VALUES ('r', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, '2011-07-08 08:40:53', NULL, NULL, 1, NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, '2011-07-08 08:40:53', NULL)

	def details
  	game_holes
		fetch_hole_colors
		reset_stats
    @active_hole = params[:active_hole]
    @active_hit = params[:active_hit]
    if @active_hit.to_i == 0
    	@active_hit = 1
    end
    if @active_hit.to_i != 1
    	fix_params(@active_hole, @active_hit, @game.id)
    else
      @hit_r_final = Hit.fetch_final_real(@game.id, @active_hole, @active_hit, current_user.id)
   	  @hit_p_final = Hit.fetch_final_planned(@game.id, @active_hole, @active_hit, current_user.id)
    end
    conditions3 = { :hit_planed_id => @hit_p_final.id,
                               :hit_real_id => @hit_r_final.id,
                               :user_id => current_user.id,
                               :game_id => @game.id}
     @pair_hit = PairHit.find(:first, :conditions => conditions3) || PairHit.create(conditions3)
     @hit_r_final.pair_id = @pair_hit.id
     @hit_p_final.pair_id = @pair_hit.id
		if @active_hit.to_i == 1
			update_hole_colors(@active_hole, @game.id)
			@hit_r_final.update_attributes(:place_from => 2)
---
INSERT INTO `hits` (`strength`, `hole_comment`, `wind`, `game_id`, `trajectory`, `user_id`, `pair_id`, `created_at`, `motion_was`, `hit_was`, `land_place`, `following_action`, `real_hit`, `direction`, `place_from`, `updated_at`, `hit_distance`, `slipums`, `comment`, `difficulty`, `hole_id`, `hole_number`, `distance_to_hole`, `misdirection`, `mistake`, `stick_id`, `hit_number`, `kritums`, `luck_factor`, `stance`) VALUES (NULL, NULL, NULL, 3, NULL, 2, NULL, '2011-07-25 11:40:56', NULL, NULL, NULL, NULL, 'rp', NULL, NULL, '2011-07-25 11:40:56', NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL)
SELECT `hits`.* FROM `hits` WHERE (`hits`.game_id = 1)
UPDATE `hits` SET `updated_at` = '2011-07-25 10:38:07', `pair_id` = 2, `place_from` = 2 WHERE `hits`.`id` = 14
UPDATE `users` SET `updated_at` = '2011-07-08 08:44:59', `last_request_at` = '2011-07-08 08:44:59' WHERE `users`.`id` = 1

  def hit_update
		@next_hole = params[:next_hole].to_s
    require_game_owner
    if @game.update_attributes(params[:game])
    end
		#ugly fix
		i = 0
		while params[:game][:hits_attributes][:"#{i}"] != nil
			puts params[:game][:hits_attributes][:"#{i}"]
			@hit1 = Hit.find_by_id(params[:game][:hits_attributes][:"#{i}"][:id])
---
UPDATE `games` SET `updated_at` = '2011-07-25 11:12:21', `active_hit` = 2 WHERE `games`.`id` = 3
SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
SELECT `hits`.* FROM `hits` WHERE `hits`.`id` IN (32) AND (`hits`.game_id = 1)

				create_hit_colors(@game_id, @next_hole.to_i)
				get_details(params[:form_id], @game_id, @next_hole, active_hit)
		 elsif params[:next_hit].to_s == 'penalty'
				Hit.create_penalty(@game_id, params[:active_hit], @next_hole)
---
INSERT INTO `hits` (`slipums`, `updated_at`, `land_place`, `direction`, `pair_id`, `wind`, `comment`, `difficulty`, `hole_id`, `user_id`, `hit_distance`, `strength`, `kritums`, `misdirection`, `mistake`, `stick_id`, `stance`, `hit_number`, `distance_to_hole`, `following_action`, `real_hit`, `luck_factor`, `hole_number`, `place_from`, `created_at`, `motion_was`, `game_id`, `hit_was`, `trajectory`, `hole_comment`) VALUES (NULL, '2011-07-25 10:49:02', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, NULL, NULL, 'rp', NULL, 2, NULL, '2011-07-25 10:49:02', NULL, 3, NULL, NULL, NULL)

	def remove_hit(game_id, hole_number)
		@hit = Hit.where(:game_id => game_id, :hole_number => hole_number).last
		if @hit.destroy
---
SELECT `hits`.* FROM `hits` WHERE (`hits`.game_id = 2)
DELETE FROM `hits` WHERE `hits`.`id` = 13

	def add_planned_hit(game_id, hole_number, hit_number)
		require_game_owner
		#end of ugly fix
		@hit_last = Hit.where(:game_id => game_id, :hole_number => hole_number).last
		@hit = Hit.create!(:game_id => game_id, :hit_number => @hit_last.hit_number.to_i + 1, :hole_number => hole_number, :real_hit => 'p', :user_id => current_user.id )
---
SELECT `hits`.* FROM `hits` WHERE (`hits`.game_id = 2)
INSERT INTO `hits` (`real_hit`, `hole_number`, `following_action`, `mistake`, `stance`, `hit_number`, `strength`, `motion_was`, `game_id`, `hit_distance`, `created_at`, `hole_id`, `user_id`, `place_from`, `slipums`, `difficulty`, `misdirection`, `distance_to_hole`, `trajectory`, `land_place`, `hole_comment`, `luck_factor`, `pair_id`, `updated_at`, `hit_was`, `wind`, `kritums`, `direction`, `stick_id`, `comment`) VALUES ('p', 1, NULL, NULL, NULL, 2, NULL, NULL, 2, NULL, '2011-07-25 09:08:18', NULL, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-07-25 09:08:18', NULL, NULL, NULL, NULL, NULL, NULL)

	def find_proper_stick
			sticks = current_user.sticks
			difference = 9999
			stickid = 0
			desired_distance = @hit_planned.hit_distance
			sticks.each do |stick|
				diff = (desired_distance - stick.distance).abs
				if difference > diff
					difference = diff
					stickid = stick.id
				end
			end
		@hit_planned.update_attributes(:stick_id => stickid)
---
SELECT `sticks`.* FROM `sticks` INNER JOIN `users_sticks` ON `sticks`.id = `users_sticks`.stick_id WHERE ((`users_sticks`.user_id = 2))
UPDATE `hits` SET `hit_distance` = 222, `land_place` = 1, `misdirection` = 3, `direction` = 1, `updated_at` = '2011-07-25 10:38:28', `stick_id` = 22 WHERE `hits`.`id` = 14