app/controllers/golf_club_controller.rb

SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
---
  def edit
    store_location
    @golf_club = GolfClub.find(current_user.golf_club.id)

SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
---
  def edit_fields
    store_location
    @golf_club = GolfClub.find(current_user.golf_club.id)

INSERT INTO `golf_clubs` (`image_p_content_type`, `start_place_by_level_low`, `created_at`, `is_v_banner_disabled`, `image_p_updated_at`, `user_id`, `image_p_file_name`, `image_p_file_size`, `is_p_banner_disabled`, `country_id`, `image_f_content_type`, `image_v_file_name`, `image_v_file_size`, `pay_banner_end_date`, `image_v_content_type`, `city`, `accepted`, `is_f_banner_disabled`, `start_place_by_level_medium`, `name`, `region`, `image_f_updated_at`, `image_f_file_size`, `web_page`, `image_v_updated_at`, `start_place_by_level_high`, `updated_at`, `active`, `image_f_file_name`) VALUES (NULL, NULL, '2011-07-25 08:48:50', 1, NULL, 2, NULL, NULL, 1, 1, NULL, NULL, NULL, NULL, NULL, 'Rīgas raj.', 'unknown', 1, NULL, 'viesturi', 'Rīga', NULL, NULL, 'www.viesturi.lv', NULL, NULL, '2011-07-25 08:48:50', 0, NULL)
---
  def create
    @golf_club = GolfClub.new(params[:golf_club])
    @golf_club.user = current_user

    respond_to do |format|
      if @golf_club.save

SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`golf_club_id` = 1
---
  def show
   @club = GolfClub.find(:first, :conditions => {:id => current_user.golf_club.id})
   @users = User.find(:all, :conditions => {:golf_club_id => @club.id})