app/controllers/statistic_controller.rb

		def edit
			@user_params = User.find(params[:user_id])
			@user_params_hints = @user_params.hints
			@is_admin = true if current_user.admin == true
 		   @is_coach = true if @user_params.coach == current_user.id
  	  @has_couch = true unless (@user_params.coach == false || @user_params.coach == nil)
  	  @coach_hints = current_user.hints
  	  @current_club_trainer = User.find(@user_params.golf_club.user_id)

  	  @user_sticks = UsersStick.where(:user_id => @user_params.id).includes(:stick)
---
SELECT `hints`.* FROM `hints` WHERE `hints`.`user_id` IS NULL AND `hints`.`stick_id` = 1 LIMIT 1