app/controllers/statistic_controller.rb

SELECT `fields`.* FROM `fields` WHERE `fields`.`golf_club_id` = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:user_id])
    @is_admin = true if @user.admin == true


    @user_fields = Field.where(:golf_club_id => @user.golf_club.id)