app/controllers/statistic_controller.rb

SELECT `game_statistics_by_holes`.* FROM `game_statistics_by_holes`
SELECT `game_statistics_by_sticks`.* FROM `game_statistics_by_sticks`
---
  def view
    @statistic = Statistic.find(:all)
    @GameStatisticsByHoles = GameStatisticsByHoles.all
    @GameStatisticsBySticks = GameStatisticsBySticks.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`id` = 1 LIMIT 1
SELECT `games`.* FROM `games` WHERE `games`.`user_id` = 1 LIMIT 100
SELECT `users_sticks`.* FROM `users_sticks` WHERE `users_sticks`.`user_id` = 1 ORDER BY @user_params.stick_type ASC
SELECT `statistics`.* FROM `statistics` WHERE `statistics`.`user_id` = 1 AND `statistics`.`stick_id` = 1 LIMIT 1
SELECT SUM(`game_statistics_by_holes`.`gir_sum`) AS sum_id FROM `game_statistics_by_holes` WHERE `game_statistics_by_holes`.`user_id` = 1
SELECT SUM(`game_statistics_by_holes`.`put_sum`) AS sum_id FROM `game_statistics_by_holes` WHERE `game_statistics_by_holes`.`user_id` = 1
SELECT SUM(`game_statistics_by_holes`.`hit_sum`) AS sum_id FROM `game_statistics_by_holes` WHERE `game_statistics_by_holes`.`user_id` = 1
SELECT `all_stick_statistics`.* FROM `all_stick_statistics` WHERE `all_stick_statistics`.`user_id` = 1 ORDER BY stick_progres DESC LIMIT 3
SELECT `game_statistics_by_sticks`.* FROM `game_statistics_by_sticks` WHERE `game_statistics_by_sticks`.`user_id` = 1 ORDER BY hits_r LIMIT 3
---
  def edit
    @user_params = User.find(params[:user_id])

    @is_admin = true if current_user.admin == true
    @is_coach = true if @user_params.coach == current_user.id
    @has_couch = true unless (@user_params.coach == false || @user_params.coach == nil)

    @current_club_trainer = User.find(@user_params.golf_club.user_id)
    @current_hints = Hint.where(:user_id => @current_club_trainer.id)
    @user_params_games_limited = Game.where(:user_id => @user_params.id).limit(100)

    @user_sticks = UsersStick.where(:user_id => @user_params.id).order("@user_params.stick_type ASC")
    @statistic = Statistic.where(:user_id => @user_params.id)


    # ======== mini stats menu
    @GameStatisticsByHoles = GameStatisticsByHoles.where(:user_id => params[:user_id]) #.order("field_id ASC")

    @gir = @GameStatisticsByHoles.sum(:gir_sum)
    @puts = @GameStatisticsByHoles.sum(:put_sum)
    @strokes = @GameStatisticsByHoles.sum(:hit_sum)

    @top_good = AllStickStatistic.where(:user_id => params[:user_id]).order('stick_progres DESC').limit(3)
    @top_fail = AllStickStatistic.where(:user_id => params[:user_id]).order('stick_progres').limit(3)
    @top_sticks = GameStatisticsBySticks.where(:user_id => params[:user_id]).order('hits_r').limit(3)

SELECT `game_filter_statistics`.* FROM `game_filter_statistics` WHERE `game_filter_statistics`.`user_id` = 1 ORDER BY created_at DESC LIMIT 8
---
  def filter_statistic
    @place_from = params[:place_from]
    @direction = params[:direction]
    @stance = params[:stance]
    @temperature = params[:temperature]
    @trajectory = params[:trajectory]
		@green_trajectory = params[:trajectory_on_green]
    @weather = params[:weather]
    #@wind = params[:wind]
    @field = params[:field_id]
    @user_id = params[:user_id]


    @filtered_games = GameFilterStatistic.where(:user_id => @user_id).order("created_at DESC").limit(8)

SELECT `game_statistic_generals`.* FROM `game_statistic_generals` WHERE `game_statistic_generals`.`game_id` = 1 LIMIT 1
---
    @all_filter_game_progress_arr = []

    @filtered_games.each do |filtered_game|
      @GSG = GameStatisticGeneral.where(:game_id => filtered_game.game_id).first

SELECT `statistic_user_progres`.* FROM `statistic_user_progres` WHERE `statistic_user_progres`.`field_id` = 1 AND `statistic_user_progres`.`hcp` = 0 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-07-08 08:50:42', `last_request_at` = '2011-07-08 08:50:42' WHERE `users`.`id` = 1
SELECT `statistic_user_progres`.* FROM `statistic_user_progres` WHERE (num IN ('--- \n- -2\n- -1\n- 0\n- 1\n- 2\n- 3\n- 4\n',1)) ORDER BY num ASC
---
  def user_place_in_golf_club
    @hcp = params[:hcp]
    @field_id = params[:field_id]
    @user_id = params[:user_id]
    @is_something_to_return = true

    @user_stats = StatisticUserProgres.where(:field_id => @field_id, :hcp => @hcp).first
    @stats_arr = []
    @stats_arr.push([@user_stats.num - 3, @user_stats.num - 2,@user_stats.num - 1,@user_stats.num, @user_stats.num + 1, @user_stats.num + 2, @user_stats.num + 3]) if @user_stats
    @stats_arr.push(@user_stats.num) if @user_stats
    #@stats_arr = [@user_stats.num - 3, @user_stats.num - 2,@user_stats.num - 1,@user_stats.num, @user_stats.num + 1, @user_stats.num + 2, @user_stats.num + 3]

    if @stats_arr.size == 0
      @is_something_to_return = false
    else
      @stats_to_return = StatisticUserProgres.where('num IN  (?)', @stats_arr).order("num ASC") #DESC")