app/controllers/sticks_controller.rb

  def show
    @sticks = Stick.find(params[:id])
---
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 1 LIMIT 1