app/controllers/user_controller.rb

SELECT `golf_clubs`.* FROM `golf_clubs` WHERE `golf_clubs`.`accepted` = 'yes'
---
  def new
    @user = User.new
    store_location
    @golf_club = GolfClub.where(:accepted => "yes")

INSERT INTO `users` (`first_name`, `last_login_at`, `measurement`, `last_login_ip`, `password_salt`, `sex`, `nick`, `new_user`, `add_club`, `birth`, `golf_club_id`, `hcp`, `last_name`, `login_count`, `current_login_ip`, `start_place_color`, `image_content_type`, `crypted_password`, `is_super_admin`, `image_updated_at`, `right_handed`, `persistence_token`, `updated_at`, `coach`, `country_id`, `last_request_at`, `failed_login_count`, `email`, `admin`, `temp_preference`, `image_file_size`, `is_blocked`, `current_login_at`, `image_file_name`, `created_at`) VALUES ('Edgars', NULL, 'meters', NULL, 'HBeIkNyp4qepUkITd6Z', 'm', 'Edžis', 1, 0, '2011-07-16', NULL, 3, 'Liepiņš', 1, '127.0.0.1', 3, 'image/jpeg', '63ae22fd8d34c5ed71ac0fb830f7cc8b75c14416f9928bb51b27cf51a9dc53b61ef1ef593250c8e71216279abda08dd57f17ad191c71eff717a2733611cc2ca6', 0, '2011-07-25 08:48:25', 1, 'e34c349785b6123779192d4005ea0deab0de23e705789bdfc76fd14de92b39bcdb83240ac6a39f12f712e94579ab71c963de5ad6ff53d529fbde5aa82b490e5d', '2011-07-25 08:48:25', NULL, 1, '2011-07-25 08:48:25', 0, 'user@user.com', 0, 'celsium', 23861, 0, '2011-07-25 08:48:25', 'cat-facts.jpg', '2011-07-25 08:48:25')
---
  def create
    @add_golf_club = false
    @user = User.new(params[:user])
    if  @user.add_club == true
      @user.add_club = false
      @add_golf_club = true
    end


    if @user.save

UPDATE `users` SET `updated_at` = '2011-07-08 06:33:29', `last_request_at` = '2011-07-08 06:33:29' WHERE `users`.`id` = 1
---
  def update
    @golf_club_id = params[:user][:golf_club_id]
    if @golf_club_id.to_i != current_user.golf_club_id.to_i
      current_user.update_attributes(:admin => false)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `users_sticks` WHERE (`users_sticks`.user_id = 1)
SELECT `sticks`.* FROM `sticks`
SELECT `users_sticks`.* FROM `users_sticks` WHERE (`users_sticks`.user_id = 1)
SELECT COUNT(*) FROM `balls` WHERE (`balls`.user_id = 1)
SELECT `balls`.* FROM `balls` WHERE (`balls`.user_id = 1)
---
  def bag
    # bag
    @user_sticks_id = :get_value

    @users_sticks = current_user.users_sticks
    @user = User.find(current_user)
    @sticks_attributes = "users_sticks_attributes[]"
    @new_sticks_attributes = (@user.users_sticks.count > 0) ? "new_users_sticks_attributes[]" : @sticks_attributes

    #Balls
    @balls = current_user.balls
    @balls_attributes = "balls_attributes[]"
    @new_balls_attributes = (@balls.count > 0) ? "new_balls_attributes[]" : @balls_attributes

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `users_sticks` WHERE (`users_sticks`.user_id = 1)
SELECT `users_sticks`.* FROM `users_sticks` WHERE `users_sticks`.`id` IN (1) AND (`users_sticks`.user_id = 1)
SELECT COUNT(*) FROM `balls` WHERE (`balls`.user_id = 1)
UPDATE `users_sticks` SET `shaft` = '3', `updated_at` = '2011-07-08 08:51:28', `degrees` = '1', `shaft_strength` = '3' WHERE `users_sticks`.`id` = 1
UPDATE `users` SET `updated_at` = '2011-07-25 08:49:20', `last_request_at` = '2011-07-25 08:49:20' WHERE `users`.`id` = 2
---
  def update_bag
    @user = current_user
    @users_sticks = current_user.users_sticks
    @user = User.find(current_user)
    @sticks_attributes = "users_sticks_attributes[]"
    @new_sticks_attributes = (@user.users_sticks.count > 0) ? "new_users_sticks_attributes[]" : @sticks_attributes

    #Balls
    @balls = current_user.balls
    @balls_attributes = "balls_attributes[]"
    @new_balls_attributes = (@balls.count > 0) ? "new_balls_attributes[]" : @balls_attributes

    params[:user] = merge_hash(params[:user], "users_sticks_attributes", "new_users_sticks_attributes")
    params[:user] = merge_hash(params[:user], "balls_attributes", "new_balls_attributes")


    respond_to do |format|
      if @user.update_attributes(params[:user])