app/controllers/welcome_controller.rb

  def index
    if current_user.is_super_admin
      redirect_to admin_path
    else
      store_location

      @top_users_progress = StatisticUserProgres.find(:all, :order => 'user_progress', :limit => 5)
      @max_hit = Hit.where("real_hit = 'p' OR real_hit = 'rp'").order('hit_distance').select("DISTINCT user_id").limit(5)
---
SELECT DISTINCT user_id FROM `hits` WHERE (real_hit = 'p' OR real_hit = 'rp') ORDER BY hit_distance LIMIT 5