app/views/admin/hints/index.html.erb

SELECT `sticks`.* FROM `sticks`
SELECT `hints`.* FROM `hints` WHERE `hints`.`user_id` = 1 AND `hints`.`stick_id` = 1 LIMIT 1
---

    <% @all_sticks = Stick.all %>
    <% @all_sticks.each do |c_stick| %>
      <% @c_admin_hits = Hint.find(:first, :conditions => {:user_id => c_admin.id, :stick_id => c_stick.id}) %>