app/views/fields/_list.html.erb

SELECT COUNT(*) FROM `fields` WHERE (`fields`.golf_club_id = 1)
SELECT `fields`.* FROM `fields` WHERE (`fields`.golf_club_id = 1)
---

    <% unless @golf_club.fields.count < 1 %>