app/views/statistic/_mini_statistic_top.erb

          <% @top_fail.each do |top_fail| %>
            <%= Stick.find(top_fail.stick_id).stick_type %>:<br/>
---
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 1 LIMIT 1

            <% @top_sticks.each do |top_stick|%>
              <%= Hit.where(:stick_id =>  top_stick.users_stick.stick_id).count %><span class="gray">x</span><br />
---
SELECT COUNT(*) FROM `hits` WHERE `hits`.`stick_id` = 1


  <% if @user_params.golf_club && Field.where(:golf_club_id => @user_params.golf_club_id).count != 0 %>
---
SELECT COUNT(*) FROM `fields` WHERE `fields`.`golf_club_id` = 1
SELECT `fields`.* FROM `fields` WHERE `fields`.`golf_club_id` = 1