app/views/statistic/_user_place_in_golf_club_view.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      <% if a.num == @user_stats.num %>
      <div class=""><b> <%= a.num  %> <%= User.find(a.user_id).first_name %> <%= User.find(a.user_id).last_name %> </b><br /></div>