app/views/statistic/edit.html.erb

SELECT COUNT(*) FROM `statistics` WHERE `statistics`.`user_id` = 1
---
    <%  @stick_count = @user_params.sticks %>
    <%  @stats_count = Statistic.where(:user_id == @user_params.id) %>