app/views/statistic/edit.html.erb


<% @my_games_for_count = Game.where(:user_id => @user_params.id) %>
---
SELECT COUNT(*) FROM `games` WHERE `games`.`user_id` IS NULL

                <div class="single_game_field">
                  <%  @GSG = GameStatisticGeneral.where(:game_id => user_params_games.id).first %>
---
SELECT `game_statistic_generals`.* FROM `game_statistic_generals` WHERE `game_statistic_generals`.`game_id` = 1 LIMIT 1

                    <div class="percentage"><p><%= " #{@GSG.game_progress}%"%></p></div>
                    <div class="date"><p><%= Game.find(user_params_games.id).updated_at.strftime("%m.%d.%Y") %> </p></div>
---
SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-07-08 09:28:22', `last_request_at` = '2011-07-08 09:28:22' WHERE `users`.`id` = 1


                <% @stats = AllStickStatistic.find(:first, :conditions => {:stick_id => stick.stick_id, :user_id => @user_params.id})%>
---
SELECT `all_stick_statistics`.* FROM `all_stick_statistics` WHERE `all_stick_statistics`.`user_id` = 1 AND `all_stick_statistics`.`stick_id` = 1 LIMIT 1
SELECT `sticks`.* FROM `sticks` WHERE `sticks`.`id` = 2 LIMIT 1