app/views/statistic/view.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      <ul>
        <li>User: <%=  User.find(s.user_id).id  %>